------------------------------------------------------------------------------------------------------------------------
-- Database
------------------------------------------------------------------------------------------------------------------------
// разбить на 2 и в корень, избавться от схема дао и листенери датасурс с3по контекст удалить
DROP
DATABASE IF EXISTS provider;

CREATE
DATABASE provider;

------------------------------------------------------------------------------------------------------------------------
-- User
------------------------------------------------------------------------------------------------------------------------

DROP
USER IF EXISTS provider;

CREATE
USER provider WITH ENCRYPTED PASSWORD 'provider';

GRANT ALL PRIVILEGES ON DATABASE
provider TO provider;
